_posts/2022-03-10-unit-tests-in-react.html
---
layout: post
title: Unit Tests In React
---

<div id="outline-container-org453b9f2" class="outline-2">
<h2 id="org453b9f2"><span class="section-number-2">1.</span> Context</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf9c26d9" class="outline-3">
<h3 id="orgf9c26d9"><span class="section-number-3">1.1.</span> Unit Tests Benefits</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Ensure code correctness at the lowest level</li>
<li>Prevents bug regressions</li>
<li>Makes code coverage look cool 😎</li>
</ul>
<div class="NOTES" id="org3bf8533">
<p>
Unit testing is the first tool programmers have to ensure the correctness of
their programs.
</p>

</div>
</div>
</div>
<div id="outline-container-orgfad3806" class="outline-3">
<h3 id="orgfad3806"><span class="section-number-3">1.2.</span> Unit Tests Definition</h3>
<div class="outline-text-3" id="text-1-2">
<p>
What makes a unit test a unit test is its scope:
</p>

<p>
Unit tests should only test one unit a time.
</p>
<div class="NOTES" id="org7887c28">
<p>
A unit is a diffuse term but it usually refers to a function or a class. A good
unit test proves the outcome of the unit under test is correct for all it's
logic branches, and for the relevant inputs. Fortunately, reaping the benefits
of unit testing is not hard because the latest developments in technology make
writing unit tests easy.
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-org6b32517" class="outline-2">
<h2 id="org6b32517"><span class="section-number-2">2.</span> Unit Tests Scope In React</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Keep in mind the React component ultimate purpose: to generate HTML code</li>
<li>A component is a unit</li>
</ul>
<div class="NOTES" id="org0f13ccb">
<p>
As in every kind application, React apps benefit from having unit tests, but
they come with their own set of complications. What's generally accepted though,
is that a React component, especially if it's simple as in markup-only
components, but even if it's complex, with state management, children, and
network calls, is an unit. With the exception of higher-order-components,
something we should always keep in mind while testing is a component's
fundamental <i>purpose</i>: to generate HTML code. This means that all that state
handling, network calling, and children bearing, will ultimately result in a
tree of HTML tags ready to be rendered by the browser.
</p>

</div>
</div>
</div>
<div id="outline-container-org5e62351" class="outline-2">
<h2 id="org5e62351"><span class="section-number-2">3.</span> Testing State vs Testing Outcomes</h2>
<div class="outline-text-2" id="text-3">
<p>
When developing unit tests there are two common approaches:
Testing state and testing outcomes.
</p>
</div>
<div id="outline-container-orgfa12d01" class="outline-3">
<h3 id="orgfa12d01"><span class="section-number-3">3.1.</span> Testing A Unit's State</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Testing state is the practice of querying the state of the unit at a given
moment of time. In React, this can be seen in tests that assert the props and/or
the state of the component is what we expect it to be at interesting points in
time, for example, when a component is rendered for the first time, or when a
button has been clicked.
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">assert</span> = require<span style="color: #268bd2;">(</span><span style="color: #2aa198;">'assert/strict'</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">function</span> <span style="color: #d75fd7; font-weight: bold;">createCounter</span><span style="color: #268bd2;">()</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">let</span> <span style="color: #8787d7;">state</span> = <span style="color: #d75fd7;">{</span> count: <span style="color: #d75fd7;">0</span> <span style="color: #d75fd7;">}</span>;
    <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #d75fd7;">{</span>
        state,
        onClick<span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
            state.count += <span style="color: #d75fd7;">1</span>;
        <span style="color: #2aa198;">}</span>,
        render<span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
            <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #2aa198;">`&lt;p&gt;Clicked ${state.count}&lt;/p&gt;`</span>;
        <span style="color: #2aa198;">}</span>,
    <span style="color: #d75fd7;">}</span>;
<span style="color: #268bd2;">}</span>

<span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">counter</span> = createCounter<span style="color: #268bd2;">()</span>;

assert.equal<span style="color: #268bd2;">(</span>counter.state.count, <span style="color: #d75fd7;">0</span><span style="color: #268bd2;">)</span>;

counter.onClick<span style="color: #268bd2;">()</span>;

assert.equal<span style="color: #268bd2;">(</span>counter.state.count, <span style="color: #d75fd7;">1</span><span style="color: #268bd2;">)</span>;
</pre>
</div>

<div class="NOTES" id="org419e07f">
<p>
My guess is we do this because when we debug we usually make sure the state is
correct step by step during the execution of our program.
</p>

<p>
What happens if we change the type of <code>state.count</code>?
What happens if we change <code>state.count</code> for <code>state.clicks</code>?
What happens if we pass the count as parameter (prop) instead of storing it as
state?
What happens if we change the word "Clicked" for "Clidkec" in the render method?
</p>

</div>
</div>
</div>
<div id="outline-container-org24643c6" class="outline-3">
<h3 id="org24643c6"><span class="section-number-3">3.2.</span> Testing A Unit's Purpose</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Testing outcomes refers to the practice of testing a unit delivers the outcomes
it's designed to deliver. In React, this means we should test a component
delivers the desired HTML code given a known context.
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">assert</span> = require<span style="color: #268bd2;">(</span><span style="color: #2aa198;">'assert/strict'</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">function</span> <span style="color: #d75fd7; font-weight: bold;">createCounter</span><span style="color: #268bd2;">()</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">let</span> <span style="color: #8787d7;">state</span> = <span style="color: #d75fd7;">{</span> count: <span style="color: #d75fd7;">0</span> <span style="color: #d75fd7;">}</span>;
    <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #d75fd7;">{</span>
        state,
        onClick<span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
            state.count += <span style="color: #d75fd7;">1</span>;
        <span style="color: #2aa198;">}</span>,
        render<span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
            <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #2aa198;">`&lt;p&gt;Clicked ${state.count}&lt;/p&gt;`</span>;
        <span style="color: #2aa198;">}</span>,
    <span style="color: #d75fd7;">}</span>;
<span style="color: #268bd2;">}</span>

<span style="color: #268bd2; font-weight: bold;">function</span> <span style="color: #d75fd7; font-weight: bold;">getInnerText</span><span style="color: #268bd2;">(</span><span style="color: #8787d7;">html</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">return</span> html.replace<span style="color: #d75fd7;">(</span><span style="color: #2aa198;">/\&lt;p\&gt;|\&lt;\/p\&gt;/</span>gi, <span style="color: #2aa198;">''</span><span style="color: #d75fd7;">)</span>;
<span style="color: #268bd2;">}</span>

<span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">counter</span> = createCounter<span style="color: #268bd2;">()</span>;

assert.equal<span style="color: #268bd2;">(</span>getInnerText<span style="color: #d75fd7;">(</span>counter.render<span style="color: #2aa198;">()</span><span style="color: #d75fd7;">)</span>, <span style="color: #2aa198;">`Clicked 0`</span><span style="color: #268bd2;">)</span>;

counter.onClick<span style="color: #268bd2;">()</span>;

assert.equal<span style="color: #268bd2;">(</span>getInnerText<span style="color: #d75fd7;">(</span>counter.render<span style="color: #2aa198;">()</span><span style="color: #d75fd7;">)</span>, <span style="color: #2aa198;">`Clicked 1`</span><span style="color: #268bd2;">)</span>;
</pre>
</div>
</div>
</div>
