posts/2022-03-10-unit-tests-in-react.org
** Test Value
The value of a test has to be proposed case by case, it depends on the unit's
purpose.

Let's examine the ~counter~ component.
#+BEGIN_SRC js
  function createCounter() {
      let state = { count: 0 };
      return {
          state,
          onClick() {
              state.count += 1;
          },
          render() {
              return `<p>Clicked ${state.count}</p>`;
          },
      };
  }
#+END_SRC
From the source code, we can tell that the counter component's output is some
HTML code that includes the number of times its ~onClick~ callback has been
called, but in the end, the component's expected /outcome/ is this:

to show a user how many times the counter has been clicked.

Note that neither the fact that the counter comes from state or props, nor if
the text is displayed inside a paragraph or a list item matters to the end user.
** Test Robustness
For every testing approach (testing a unit's state and testing a unit's
purpose), ask the following questions:

- What happens if we change the type of ~state.count~?
- What happens if we change ~state.count~ for ~state.clicks~?
- What happens if we pass the count as parameter (prop) instead of storing it as state?
- What happens if we change the word "Clicked" for "Clidkec" in the render method?
 
In general, test robustness increases when we test outcomes instead of state.
* When To Test The Redux ~connect~ HOC
Redux is a wonderful state management solution that happens to work pretty well
when combined with React using the ~react-redux~ package. The package provides
the ~connect~ HOC which does what its name implies. When we test a component
like this:
#+BEGIN_SRC javascript
  import React from 'react';
  import { connect } from 'react-redux';

  const Prompt = ({ name }) => (<p>{`Hello ${name}!`}</p>);

  const mapStateToProps = (state) => ({ name: state.name });

  export default connect(mapStateToProps)(Prompt);
#+END_SRC
we end up testing 2 things instead of one, making our tests more complex and
brittle than they needed to be.
** Abstract Test Value
*** Does it render?
One of the most common unit tests there are, are the ones that check the
component actually renders with a given set of valid props. If we test the
default export from the component above, we will end up testing that our Redux
setup works (either the real deal or a mocked store), that the connect HOC
doesn't have any logic errors, and that the actual component (~Prompt~) works.
To simplify this test, we should export the ~Prompt~ component separately and
test it in isolation with different props combinations.
*** Does it generate the desired ~props~?
When we have connected components there's something else beside rendering
success that could be considered fundamental: testing the main component is
getting the props it needs. Most of the time, the logic in the ~mapStateToProps~
function is pretty simple, as it should, thus, writing tests for it should be
similarily simple. We have to remember exporting it by itself and testing it
with different inputs to ensure it generates the necessary props.
* How To Test React Components
By adhering to the principle of testing purpose instead of state, we will see
more clearly the tests a component needs, when using the right tools for the job.
** Abstract Test Value
*** Does it render?
Even when successful rendering is implied in other tests, because a component
wouldn't fulfill its purpose if it didn't render in the first place, I like
adding this basic unit test; it is mandatory if you're doing TDD. Now that we
separated the notion of Redux adapter and React component, we know that we
should export the component separately and test it in isolation.
