_posts/2022-03-10-unit-tests-in-react.html
<div id="outline-container-orgdd459be" class="outline-3">
<h3 id="orgdd459be"><span class="section-number-3">3.3.</span> Test Value</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The value of a test has to be proposed case by case, it depends on the unit's
purpose.
</p>

<p>
Let's examine the <code>counter</code> component.
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #268bd2; font-weight: bold;">function</span> <span style="color: #d75fd7; font-weight: bold;">createCounter</span><span style="color: #268bd2;">()</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">let</span> <span style="color: #8787d7;">state</span> = <span style="color: #d75fd7;">{</span> count: <span style="color: #d75fd7;">0</span> <span style="color: #d75fd7;">}</span>;
    <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #d75fd7;">{</span>
        state,
        onClick<span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
            state.count += <span style="color: #d75fd7;">1</span>;
        <span style="color: #2aa198;">}</span>,
        render<span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
            <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #2aa198;">`&lt;p&gt;Clicked ${state.count}&lt;/p&gt;`</span>;
        <span style="color: #2aa198;">}</span>,
    <span style="color: #d75fd7;">}</span>;
<span style="color: #268bd2;">}</span>
</pre>
</div>
<p>
From the source code, we can tell that the counter component's output is some
HTML code that includes the number of times its <code>onClick</code> callback has been
called, but in the end, the component's expected <i>outcome</i> is this:
</p>

<p>
to show a user how many times the counter has been clicked.
</p>

<p>
Note that neither the fact that the counter comes from state or props, nor if
the text is displayed inside a paragraph or a list item matters to the end user.
</p>
</div>
</div>
<div id="outline-container-orgfba5892" class="outline-3">
<h3 id="orgfba5892"><span class="section-number-3">3.4.</span> Test Robustness</h3>
<div class="outline-text-3" id="text-3-4">
<p>
For every testing approach (testing a unit's state and testing a unit's
purpose), ask the following questions:
</p>

<ul class="org-ul">
<li>What happens if we change the type of <code>state.count</code>?</li>
<li>What happens if we change <code>state.count</code> for <code>state.clicks</code>?</li>
<li>What happens if we pass the count as parameter (prop) instead of storing it as state?</li>
<li>What happens if we change the word "Clicked" for "Clidkec" in the render method?</li>
</ul>

<p>
In general, test robustness increases when we test outcomes instead of state.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb3d3f25" class="outline-2">
<h2 id="orgb3d3f25"><span class="section-number-2">4.</span> When To Test The Redux <code>connect</code> HOC</h2>
<div class="outline-text-2" id="text-4">
<p>
Redux is a wonderful state management solution that happens to work pretty well
when combined with React using the <code>react-redux</code> package. The package provides
the <code>connect</code> HOC which does what its name implies. When we test a component
like this:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #268bd2; font-weight: bold;">import</span> React from <span style="color: #2aa198;">'react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> connect <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'react-redux'</span>;

<span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">Prompt</span> = <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">{</span> name <span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span> =&gt; <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">p</span><span style="color: #d75fd7;">&gt;{</span><span style="color: #2aa198;">`Hello ${name}!`</span><span style="color: #d75fd7;">}&lt;</span>/<span style="color: #d75fd7; font-weight: bold;">p</span><span style="color: #d75fd7;">&gt;</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">mapStateToProps</span> = <span style="color: #268bd2;">(</span>state<span style="color: #268bd2;">)</span> =&gt; <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">{</span> name: state.name <span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">export</span> <span style="color: #268bd2; font-weight: bold;">default</span> connect<span style="color: #268bd2;">(</span>mapStateToProps<span style="color: #268bd2;">)(</span>Prompt<span style="color: #268bd2;">)</span>;
</pre>
</div>
<p>
we end up testing 2 things instead of one, making our tests more complex and
brittle than they needed to be.
</p>
</div>
<div id="outline-container-org5673fdd" class="outline-3">
<h3 id="org5673fdd"><span class="section-number-3">4.1.</span> Abstract Test Value</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org9c2232b" class="outline-4">
<h4 id="org9c2232b"><span class="section-number-4">4.1.1.</span> Does it render?</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
One of the most common unit tests there are, are the ones that check the
component actually renders with a given set of valid props. If we test the
default export from the component above, we will end up testing that our Redux
setup works (either the real deal or a mocked store), that the connect HOC
doesn't have any logic errors, and that the actual component (<code>Prompt</code>) works.
To simplify this test, we should export the <code>Prompt</code> component separately and
test it in isolation with different props combinations.
</p>
</div>
</div>
<div id="outline-container-orge90e0ce" class="outline-4">
<h4 id="orge90e0ce"><span class="section-number-4">4.1.2.</span> Does it generate the desired <code>props</code>?</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
When we have connected components there's something else beside rendering
success that could be considered fundamental: testing the main component is
getting the props it needs. Most of the time, the logic in the <code>mapStateToProps</code>
function is pretty simple, as it should, thus, writing tests for it should be
similarily simple. We have to remember exporting it by itself and testing it
with different inputs to ensure it generates the necessary props.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org39e840d" class="outline-2">
<h2 id="org39e840d"><span class="section-number-2">5.</span> How To Test React Components</h2>
<div class="outline-text-2" id="text-5">
<p>
By adhering to the principle of testing purpose instead of state, we will see
more clearly the tests a component needs, when using the right tools for the job.
</p>
</div>
<div id="outline-container-orgf15b152" class="outline-3">
<h3 id="orgf15b152"><span class="section-number-3">5.1.</span> Abstract Test Value</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orge6122bf" class="outline-4">
<h4 id="orge6122bf"><span class="section-number-4">5.1.1.</span> Does it render?</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Even when successful rendering is implied in other tests, because a component
wouldn't fulfill its purpose if it didn't render in the first place, I like
adding this basic unit test; it is mandatory if you're doing TDD. Now that we
separated the notion of Redux adapter and React component, we know that we
should export the component separately and test it in isolation.
</p>
</div>
</div>
