posts/2022-03-10-unit-tests-in-react.org
*** Does it generate the desired HTML?
Since we control the props we pass to the component while testing, we can assume
they will be right, so no need to double check them. The purpose of a React
component is to generate HTML, we should be looking at the DOM or virtual DOM
for the expected HTML code.

This means that if we have a component like this:
#+BEGIN_SRC javascript
  import React from 'react';
  import { connect } from 'react-redux';

  export const Prompt = ({ name }) => (<p>{`Hello ${name}!`}</p>);

  const mapStateToProps = (state) => ({ name: state.name });

  export default connect(mapStateToProps)(Prompt);
#+END_SRC
Our most simple test would look like this:
#+BEGIN_SRC javascript
  import React from 'react';
  import { render } from '@testing-library/react';
  import { Prompt } from './Prompt';

  describe("<Prompt />", () => {
    describe("when provided complete and valid props", () => {
      it("renders correctly", () => {
        const name = "Mario";
        const wrapper = render(<Prompt name={name} />);
        expect(wrapper.findByText(name)).toBeInTheDocument();
      });
    });
  });
#+END_SRC
