_posts/2022-03-10-unit-tests-in-react.html
<div id="outline-container-org1c20b3d" class="outline-4">
<h4 id="org1c20b3d"><span class="section-number-4">5.1.2.</span> Does it generate the desired HTML?</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Since we control the props we pass to the component while testing, we can assume
they will be right, so no need to double check them. The purpose of a React
component is to generate HTML, we should be looking at the DOM or virtual DOM
for the expected HTML code.
</p>

<p>
This means that if we have a component like this:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #268bd2; font-weight: bold;">import</span> React from <span style="color: #2aa198;">'react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> connect <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'react-redux'</span>;

<span style="color: #268bd2; font-weight: bold;">export</span> <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">Prompt</span> = <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">{</span> name <span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span> =&gt; <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">p</span><span style="color: #d75fd7;">&gt;{</span><span style="color: #2aa198;">`Hello ${name}!`</span><span style="color: #d75fd7;">}&lt;</span>/<span style="color: #d75fd7; font-weight: bold;">p</span><span style="color: #d75fd7;">&gt;</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">mapStateToProps</span> = <span style="color: #268bd2;">(</span>state<span style="color: #268bd2;">)</span> =&gt; <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">{</span> name: state.name <span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">export</span> <span style="color: #268bd2; font-weight: bold;">default</span> connect<span style="color: #268bd2;">(</span>mapStateToProps<span style="color: #268bd2;">)(</span>Prompt<span style="color: #268bd2;">)</span>;
</pre>
</div>
<p>
Our most simple test would look like this:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #268bd2; font-weight: bold;">import</span> React from <span style="color: #2aa198;">'react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> render <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'@testing-library/react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> Prompt <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'./Prompt'</span>;

describe<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"&lt;Prompt /&gt;"</span>, <span style="color: #d75fd7;">()</span> =&gt; <span style="color: #d75fd7;">{</span>
  describe<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"when provided complete and valid props"</span>, <span style="color: #67b11d;">()</span> =&gt; <span style="color: #67b11d;">{</span>
    it<span style="color: #875f00;">(</span><span style="color: #2aa198;">"renders correctly"</span>, <span style="color: #268bd2;">()</span> =&gt; <span style="color: #268bd2;">{</span>
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">name</span> = <span style="color: #2aa198;">"Mario"</span>;
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">wrapper</span> = render<span style="color: #d75fd7;">(</span><span style="color: #2aa198;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">Prompt</span> <span style="color: #8787d7;">name</span>=<span style="color: #887070;">{</span>name<span style="color: #887070;">}</span> /<span style="color: #2aa198;">&gt;</span><span style="color: #d75fd7;">)</span>;
      expect<span style="color: #d75fd7;">(</span>wrapper.findByText<span style="color: #2aa198;">(</span>name<span style="color: #2aa198;">)</span><span style="color: #d75fd7;">)</span>.toBeInTheDocument<span style="color: #d75fd7;">()</span>;
    <span style="color: #268bd2;">}</span><span style="color: #875f00;">)</span>;
  <span style="color: #67b11d;">}</span><span style="color: #2aa198;">)</span>;
<span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>;
</pre>
</div>
</div>
</div>
</div>
