posts/2022-03-10-unit-tests-in-react.org
** Testing The Outcomes
Now assume a little more complex component:
#+BEGIN_SRC javascript
  import React, { useState } from 'react';
  import { connect } from 'react-redux';

  export const Prompt = ({ name }) => {
    const [loggedIn, setLoggedIn] = useState(false);
    return (<>
      <p>{loggedIn ? `Hello ${name}!` : "Hello stranger"}</p>
      <button onClick={() => setLoggedIn(!loggedIn)}>click</button>;
    </>);
  };

  const mapStateToProps = (state) => ({ name: state.name });

  export default connect(mapStateToProps)(Prompt);
#+END_SRC

The following test would excercise both logic branches:
#+BEGIN_SRC javascript
  import React from 'react';
  import userEvent from '@testing-library/user-event';
  import { render } from '@testing-library/react';
  import { Prompt } from './Prompt';

  describe("<Prompt />", () => {
    describe("when provided complete and valid props", () => {
      it("renders correctly", () => {
        const name = "Mario";
        const wrapper = render(<Prompt name={name} />);
        expect(wrapper.findByText(name)).toBeInTheDocument();
      });

      it("has a generic greeting", () => {
        const name = "Mario";
        const wrapper = render(<Prompt name={name} />);
        expect(wrapper.findByText(/stranger/)).toBeInTheDocument();
      });

      describe("when the button is clicked once", () => {
        const name = "Mario";
        const wrapper = render(<Prompt name={name} />);
        userEvent.click(wrapper.findByText(/click/));
        expect(wrapper.findByText(name)).toBeInTheDocument();
      });
    });
  });
#+END_SRC
* Final Words
:PROPERTIES:
:UNNUMBERED: notoc
:END:
* QA
