_posts/2022-03-10-unit-tests-in-react.html
<div id="outline-container-org03937ba" class="outline-3">
<h3 id="org03937ba"><span class="section-number-3">5.2.</span> Testing The Outcomes</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Now assume a little more complex component:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #268bd2; font-weight: bold;">import</span> React, <span style="color: #268bd2;">{</span> useState <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> connect <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'react-redux'</span>;

<span style="color: #268bd2; font-weight: bold;">export</span> <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">Prompt</span> = <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">{</span> name <span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span> =&gt; <span style="color: #268bd2;">{</span>
  <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #d75fd7;">[</span><span style="color: #8787d7;">loggedIn</span>, <span style="color: #8787d7;">setLoggedIn</span><span style="color: #d75fd7;">]</span> = useState<span style="color: #d75fd7;">(</span><span style="color: #d75fd7;">false</span><span style="color: #d75fd7;">)</span>;
  <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #d75fd7;">(</span><span style="color: #2aa198;">&lt;&gt;</span>
<span style="color: #b2b2b2; background-color: nil;">    </span><span style="color: #2aa198;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">p</span><span style="color: #2aa198;">&gt;{</span>loggedIn ? <span style="color: #2aa198;">`Hello ${name}!`</span> : <span style="color: #2aa198;">"Hello stranger"</span><span style="color: #2aa198;">}&lt;</span>/<span style="color: #d75fd7; font-weight: bold;">p</span><span style="color: #2aa198;">&gt;</span>
<span style="color: #b2b2b2; background-color: nil;">    </span><span style="color: #2aa198;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">button</span> <span style="color: #8787d7;">onClick</span>=<span style="color: #67b11d;">{</span><span style="color: #875f00;">()</span> =&gt; setLoggedIn<span style="color: #875f00;">(</span>!loggedIn<span style="color: #875f00;">)</span><span style="color: #67b11d;">}</span><span style="color: #2aa198;">&gt;</span><span style="color: #b2b2b2; background-color: nil;">click</span><span style="color: #2aa198;">&lt;</span>/<span style="color: #d75fd7; font-weight: bold;">button</span><span style="color: #2aa198;">&gt;</span><span style="color: #b2b2b2; background-color: nil;">;</span>
<span style="color: #b2b2b2; background-color: nil;">  </span><span style="color: #2aa198;">&lt;</span>/<span style="color: #2aa198;">&gt;</span><span style="color: #d75fd7;">)</span>;
<span style="color: #268bd2;">}</span>;

<span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">mapStateToProps</span> = <span style="color: #268bd2;">(</span>state<span style="color: #268bd2;">)</span> =&gt; <span style="color: #268bd2;">(</span><span style="color: #d75fd7;">{</span> name: state.name <span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>;

<span style="color: #268bd2; font-weight: bold;">export</span> <span style="color: #268bd2; font-weight: bold;">default</span> connect<span style="color: #268bd2;">(</span>mapStateToProps<span style="color: #268bd2;">)(</span>Prompt<span style="color: #268bd2;">)</span>;
</pre>
</div>

<p>
The following test would excercise both logic branches:
</p>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #268bd2; font-weight: bold;">import</span> React from <span style="color: #2aa198;">'react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> userEvent from <span style="color: #2aa198;">'@testing-library/user-event'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> render <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'@testing-library/react'</span>;
<span style="color: #268bd2; font-weight: bold;">import</span> <span style="color: #268bd2;">{</span> Prompt <span style="color: #268bd2;">}</span> from <span style="color: #2aa198;">'./Prompt'</span>;

describe<span style="color: #268bd2;">(</span><span style="color: #2aa198;">"&lt;Prompt /&gt;"</span>, <span style="color: #d75fd7;">()</span> =&gt; <span style="color: #d75fd7;">{</span>
  describe<span style="color: #2aa198;">(</span><span style="color: #2aa198;">"when provided complete and valid props"</span>, <span style="color: #67b11d;">()</span> =&gt; <span style="color: #67b11d;">{</span>
    it<span style="color: #875f00;">(</span><span style="color: #2aa198;">"renders correctly"</span>, <span style="color: #268bd2;">()</span> =&gt; <span style="color: #268bd2;">{</span>
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">name</span> = <span style="color: #2aa198;">"Mario"</span>;
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">wrapper</span> = render<span style="color: #d75fd7;">(</span><span style="color: #2aa198;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">Prompt</span> <span style="color: #8787d7;">name</span>=<span style="color: #887070;">{</span>name<span style="color: #887070;">}</span> /<span style="color: #2aa198;">&gt;</span><span style="color: #d75fd7;">)</span>;
      expect<span style="color: #d75fd7;">(</span>wrapper.findByText<span style="color: #2aa198;">(</span>name<span style="color: #2aa198;">)</span><span style="color: #d75fd7;">)</span>.toBeInTheDocument<span style="color: #d75fd7;">()</span>;
    <span style="color: #268bd2;">}</span><span style="color: #875f00;">)</span>;

    it<span style="color: #875f00;">(</span><span style="color: #2aa198;">"has a generic greeting"</span>, <span style="color: #268bd2;">()</span> =&gt; <span style="color: #268bd2;">{</span>
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">name</span> = <span style="color: #2aa198;">"Mario"</span>;
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">wrapper</span> = render<span style="color: #d75fd7;">(</span><span style="color: #2aa198;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">Prompt</span> <span style="color: #8787d7;">name</span>=<span style="color: #887070;">{</span>name<span style="color: #887070;">}</span> /<span style="color: #2aa198;">&gt;</span><span style="color: #d75fd7;">)</span>;
      expect<span style="color: #d75fd7;">(</span>wrapper.findByText<span style="color: #2aa198;">(</span><span style="color: #2aa198;">/stranger/</span><span style="color: #2aa198;">)</span><span style="color: #d75fd7;">)</span>.toBeInTheDocument<span style="color: #d75fd7;">()</span>;
    <span style="color: #268bd2;">}</span><span style="color: #875f00;">)</span>;

    describe<span style="color: #875f00;">(</span><span style="color: #2aa198;">"when the button is clicked once"</span>, <span style="color: #268bd2;">()</span> =&gt; <span style="color: #268bd2;">{</span>
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">name</span> = <span style="color: #2aa198;">"Mario"</span>;
      <span style="color: #268bd2; font-weight: bold;">const</span> <span style="color: #8787d7;">wrapper</span> = render<span style="color: #d75fd7;">(</span><span style="color: #2aa198;">&lt;</span><span style="color: #d75fd7; font-weight: bold;">Prompt</span> <span style="color: #8787d7;">name</span>=<span style="color: #887070;">{</span>name<span style="color: #887070;">}</span> /<span style="color: #2aa198;">&gt;</span><span style="color: #d75fd7;">)</span>;
      userEvent.click<span style="color: #d75fd7;">(</span>wrapper.findByText<span style="color: #2aa198;">(</span><span style="color: #2aa198;">/click/</span><span style="color: #2aa198;">)</span><span style="color: #d75fd7;">)</span>;
      expect<span style="color: #d75fd7;">(</span>wrapper.findByText<span style="color: #2aa198;">(</span>name<span style="color: #2aa198;">)</span><span style="color: #d75fd7;">)</span>.toBeInTheDocument<span style="color: #d75fd7;">()</span>;
    <span style="color: #268bd2;">}</span><span style="color: #875f00;">)</span>;
  <span style="color: #67b11d;">}</span><span style="color: #2aa198;">)</span>;
<span style="color: #d75fd7;">}</span><span style="color: #268bd2;">)</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6c418bd" class="outline-2">
<h2 id="org6c418bd">Final Words</h2>
<div class="outline-text-2" id="text-org6c418bd">
</div>
</div>
<div id="outline-container-orgdf78788" class="outline-2">
<h2 id="orgdf78788"><span class="section-number-2">6.</span> QA</h2>
</div>
